# Чек-лист для ручного тестирования API детекции лиц

1. **Проверка успешной детекции лица**
    - [ ] Подготовить изображение `rayan.jpeg`.
    - [ ] Отправить POST-запрос на URL `https://demo.3divi.ai/face-detector-face-fitter/v2/process/sample` с телом запроса, содержащим изображение в формате base64.
    - [ ] Проверить, что статус код ответа равен 200.
    - [ ] Убедиться, что в ответе есть ключ `objects`.
    - [ ] Проверить, что в `objects` есть хотя бы один объект.
    - [ ] Убедиться, что первый объект имеет класс `face`.

2. **Проверка обработки невалидного формата изображения**
    - [ ] Подготовить невалидное изображение `rayan_invalid.xlsx`.
    - [ ] Отправить POST-запрос на URL `https://demo.3divi.ai/face-detector-face-fitter/v2/process/sample` с телом запроса, содержащим изображение в формате base64.
    - [ ] Проверить, что статус код ответа равен 422.
    - [ ] Убедиться, что в ответе есть ключ `detail`.
    - [ ] Проверить, что в `detail` есть сообщение об ошибке для ключа `blob`.

3. **Проверка случая, когда изображение не предоставлено**
    - [ ] Отправить POST-запрос на URL `https://demo.3divi.ai/face-detector-face-fitter/v2/process/sample` с пустым телом запроса.
    - [ ] Проверить, что статус код ответа равен 422.
    - [ ] Убедиться, что в ответе есть ключ `detail`.
    - [ ] Проверить, что в `detail` есть сообщение об ошибке для ключа `_image`.

4. **Проверка детекции нескольких лиц**
    - [ ] Подготовить изображение `multiple_faces.jpg`.
    - [ ] Отправить POST-запрос на URL `https://demo.3divi.ai/face-detector-face-fitter/v2/process/sample` с телом запроса, содержащим изображение в формате base64.
    - [ ] Проверить, что статус код ответа равен 200.
    - [ ] Убедиться, что в ответе есть ключ `objects`.
    - [ ] Проверить, что в `objects` есть более одного объекта.
    - [ ] Убедиться, что все объекты имеют класс `face`.
